#1. დაწერეთ პროგრამა რომელიც მომხმარებელს ჰკითხავს წონას(კგ) და სიმაღლეს(მ), შეყვანილი მონაცემების 
# გამოითვლის BMI-ს(Body Mass Index). ფორმულა: წონა გაყოფილი სიმაღლის კვადრატზე
# BMI ნაკლებია 19-ზე, გამოიტანეთ ინფო რომ ის არის underweight
# BMI არის 19 და 25 შორის, გამოიტანეთ ინფო რომ ის არის normalweight
#თუ BMI მეტია 25-ზე, გამოიტანეთ ინფო რომ ის არის overweight 

m = float(input("ჩაწერეთ თქვენი წონა კილოგრამებში:"))
h = float(input("ჩაწერეთ თქვენი სიმაღლე მეტრებში:"))

BMI = m / (h ** 2)
print (" თქვენი BMI არის: {: .2f}".format(BMI))

if BMI < 19:
 print ("underweight")
elif 19 <= BMI <=25:
 print ("normalweght ")
else:
 print ("overweght")

#2. დაწერეთ კალკულატორის პროგრამა, რომელიც მომხმარებელს შეეკითხება ორ რიცხვს და არითმეტიკულ ოპერატორს,
#შესაბამისი ოპერატორის საფუძველზე გამოითვლის ამ ორი რიცხვის შედეგს.
num1 = float(input("ჩაწერეთ პირველი რიცხვი: "))
num2 = float(input("ჩაწერეთ მეორე რიცხვი: "))

operator = input ("+, -, *, /):")
if operator == "+":
    result = num1 + num2
elif operator == "-":
    result = num1 - num2
elif operator == "*" :
    result = num1 * num2
elif operator == "/":
    result = num1 / num2
print (result)  


#3. დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება 3 რიცხვს, ჯერ შეამოწმეთ ეს რიცხვები არ უდრიდეს ერთმანეთს,
#თუ რომელიმე ორი ერთმანეთს უდრის, დაპრინტეთ რომ შეიყვანოს განსხვავებული რიცხვები. თუ რიცხვები განსხვავებულია, 
#იპოვეთ ყველაზე დიდი რიცხვი

a = int(input("შეიყვანეთ პირველი რიცხვი:"))
b = int(input("შეიყვანეთ მეორე რიცხვი:"))
c = int(input("შეიყვანეთ მესამე რიცხვი:"))

if a == b or a == c or b == c:
  print("ჩაწერე განსხვავებული რიცხვი.")
else:
 largest = a
 if b > largest:
  largest = b
 if c > largest:
  largest = c
 print("ყველაზე დიდი რიცხვი არის:", largest)
