#1. დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება რიცხვს და გამოითვლის არ რიცხვის ფაქტორიალს, შეგახსენებთ რომ ფაქტორიალი 
#არის ამ რიცხვის ნამრავლი ყველა მთელ რიცხვზე 1-მდე, ანუ 5-ის ფაქტორიალი არის 5 X 4 X 3 X 2 X 1 (დაწერეთ for ლუპის გამოყენებით)

n = int(input("ჩაწერეთ მთელი დადებითი რიცხვი: "))
if n < 0:
    print("უარყოფით რიცხვზე ფაქტორიალი არ გამოითვლება!")
else:
    fact = 1    
for i in range( n, 0, -1): 
    fact *= i
print (f"{n}-ის ფაქტორიალია: {fact}")


#2. დაწერეთ გამრავლების ტაბულა, მაგალითად ასეთი სახით:
#1 * 1 = 1
#1 * 2 = 2
#1 * 3 = 3
#.........
#9 * 7 = 63
#9 * 8 = 72
#9 * 9 = 81

for i in range (1, 10):
    for e in range (1, 10):
        print (f"{i} x {e} = {i * e}")   
    print() 

